export const sajuTableData = {
  name: "김로켓",
  birthday: "1980년 8월27일 08:10",
  headers: ["", "時", "日", "月", "年"],
  rows: [
    // 1행: 십성
    [
      { main: "十星", sub1: "(십성)" },
      { main: "傷官", sub1: "(상관)" },
      { main: "比肩", sub1: "(비견)" },
      { main: "傷官", sub1: "(상관)" },
      { main: "傷官", sub1: "(상관)" },
    ],
    // 2행: 천간
    [
      { main: "天干", sub1: "(천간)" },
      { main: "임", sub1: "壬", sub2: "陽水" },
      { main: "정", sub1: "丁", sub2: "陰火" },
      { main: "계", sub1: "癸", sub2: "陰水" },
      { main: "계", sub1: "癸", sub2: "陰水" },
    ],
    // 3행: 지지
    [
      { main: "地支", sub1: "(지지)" },
      { main: "인", sub1: "寅", sub2: "陽木" },
      { main: "사", sub1: "巳", sub2: "陰火" },
      { main: "해", sub1: "亥", sub2: "陰水" },
      { main: "유", sub1: "酉", sub2: "陰金" },
    ],
    // 4행: 십성
    [
      { main: "十星", sub1: "(십성)" },
      { main: "比肩", sub1: "(비견)" },
      { main: "劫財", sub1: "(겁재)" },
      { main: "食神", sub1: "(식신)" },
      { main: "偏財", sub1: "(편재)" },
    ],
    // 5행: 십이운성
    [
      { main: "十二運星", sub1: "(십이운성)" },
      { main: "死", sub1: "(사)" },
      { main: "帝旺", sub1: "(제왕)" },
      { main: "胎", sub1: "(태)" },
      { main: "長生", sub1: "(장생)" },
    ],
    // 6행: 십이신살
    [
      { main: "十二神殺", sub1: "(십이신살)" },
      { main: "劫殺", sub1: "(겁살)" },
      { main: "地殺", sub1: "(지살)" },
      { main: "驛馬殺", sub1: "(역마살)" },
      { main: "驛馬殺", sub1: "(장성살)" },
    ],
    // 7행: 귀인
    [
      { main: "貴人", sub1: "(귀인)" },
      { main: "", sub1: "(없음)" },
      { main: "", sub1: "(없음)" },
      { main: "天乙", sub1: "(천을귀인)" },
      [
        { main: "天乙", sub1: "(천을귀인)" },
        { main: "太極", sub1: "(태극귀인)" },
        { main: "文昌", sub1: "(문창귀인)" },
      ],
    ],
  ],
};
